## Terraform Plan Summary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.sys_app_1232_gcn will be created
  + resource "google_storage_bucket" "sys_app_1232_gcn" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "sys-app-1232-gcn"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
